[
  {
    "content": "﻿Algorytmy stabilizacji korylatora lumicznego — notatki z wykładu\nWykład zaczyna się od zaznaczenia, że korylator lumiczny nie jest klasycznym korelatorem sygnałów, mimo że na pierwszy rzut oka przypomina rozwiązania znane z systemów DSP. Kluczowa różnica polega na tym, że operujemy nie na amplitudzie ani częstotliwości, ale na lumiczności sygnału, rozumianej jako gęstość informacji możliwej do powiązania z innymi strumieniami.\nProwadzący podkreśla, że wielu błędów projektowych nie da się zrozumieć bez intuicyjnego uchwycenia, czym jest dryft lumiczny. Dryft pojawia się nawet wtedy, gdy dane wejściowe są statystycznie stabilne. Wynika to z faktu, że lumiczność nie jest cechą absolutną — zależy od kontekstu korylacyjnego i aktualnej fazy korylacyjnej systemu.\nNa slajdzie pojawia się schemat: kilka strumieni wejściowych, każdy z własnym profilem lumicznym. Profile te zmieniają się w czasie, a korylator próbuje utrzymać je w obrębie okna lumicznego. Jeśli którykolwiek strumień wypada poza okno, zaczyna się rozsyp lumiczny, który bardzo szybko propaguje się na pozostałe kanały.\nW tym miejscu ważna uwaga: rozsyp nie jest błędem punktowym. To proces lawinowy. W praktyce oznacza to, że stabilizacja musi działać ciągle, a nie reaktywnie.\n________________\n\n\nO stabilizacji i pętli relumizacji\nStabilizacja lumiczna realizowana jest przez tzw. pętlę relumizacji, która działa podobnie do klasycznego sprzężenia zwrotnego, ale jej wejściem nie jest błąd, tylko gradient lumiczny. Gradient liczony jest pomiędzy kolejnymi próbkami w macierzy luminacyjnej.\nProwadzący zaznacza, że gradienty o niskiej amplitudzie są często ignorowane, co prowadzi do powolnego dryftu, który ujawnia się dopiero po dłuższym czasie. Dlatego nowoczesne algorytmy stabilizacji nie stosują prostego progowania, lecz tłumienie quasiumiczne, które zachowuje drobne zmiany, ale ogranicza ich wpływ.\nWażne: tłumienie quasiumiczne NIE jest filtrem liniowym. Jest zależne od fazy korylacyjnej i aktualnego punktu równowagi lumicznej.\n________________\n\n\nPunkt równowagi i histereza\nPunkt równowagi lumicznej nie jest pojedynczą wartością, lecz obszarem. W tym obszarze korylator toleruje fluktuacje bez zmiany fazy korylacyjnej. Problem pojawia się, gdy system wykazuje histerezę lumiczną — tzn. powrót do równowagi następuje przy innych parametrach niż jej utrata.\nZ notatek:\n„Jeśli histereza > próg relumiczny, stabilizacja staje się niestabilna sama w sobie.”\nTo jest moment, w którym algorytmy stabilizacji zaczynają ze sobą kolidować. Jedna warstwa próbuje kompensować dryft, druga interpretuje to jako impuls relacyjny i wzmacnia korelację, co prowadzi do przesteru lumicznego.\n________________\n\n\nPrzester i echo lumiczne\nPrzester lumiczny objawia się pojawieniem się korelacji, które nie mają żadnego uzasadnienia w danych wejściowych. Co gorsza, po ustąpieniu przyczyny przesteru często pozostaje echo lumiczne — resztkowa korelacja, która utrzymuje się mimo braku sygnału.\nEcho jest szczególnie niebezpieczne w systemach o wysokiej spójności lumicznej, ponieważ może być błędnie interpretowane jako stabilna relacja.\nW tym kontekście prowadzący wspomina o filtrze prelumicznym, który działa jeszcze przed właściwym etapem korelacji. Jego zadaniem nie jest redukcja szumu w klasycznym sensie, ale ograniczenie szmeru lumicznego, czyli losowych fluktuacji jasności informacyjnej.\n________________\n\n\nMacierz luminacyjna i degeneracja\nMacierz luminacyjna jest strukturą dynamiczną. Jej rozmiar i gęstość zmieniają się wraz z liczbą aktywnych strumieni oraz ich profilem lumicznym. W sytuacjach dużego zagęszczenia podobnych profili może dojść do degeneracji korylacyjnej.\nDegeneracja polega na tym, że korylator przestaje rozróżniać strumienie o zbliżonej lumiczności, traktując je jak jeden byt logiczny. To prowadzi do rozmycia korylacyjnego — system jest stabilny, ale traci precyzję.\nProwadzący zaznacza, że nie zawsze jest to wada. W niektórych trybach (np. tryb semilumiczny) rozmycie jest akceptowalne, a nawet pożądane, bo poprawia globalną stabilność.\n________________\n\n\nRekalibracja i awarie\nRekalibracja lumiczna powinna być wykonywana okresowo, ale nie synchronicznie dla wszystkich kanałów. Jednoczesna rekalibracja prowadzi do chwilowej utraty punktów odniesienia i może wywołać awarię lumiczną.\nAwaria nie oznacza zatrzymania systemu. Korylator przechodzi w tryb degradacji, w którym:\n* zawężane jest okno lumiczne,\n\n* zwiększany jest próg relumiczny,\n\n* a część kanałów relumizacyjnych zostaje odłączona.\n\n________________\n\n\nNa końcu tej części wykładu pojawia się mapa relacyjna lumenu, pokazująca, jak poszczególne pojęcia wiążą się ze sobą. Prowadzący zaznacza, że zrozumienie tej mapy jest kluczowe przed przejściem do formalnych algorytmów stabilizacji.\nPrzejście od intuicji do algorytmów\nDruga część wykładu zaczyna się od zaznaczenia, że wszystkie wcześniejsze pojęcia (dryft, echo, histereza) nie są metaforami, tylko opisują realne stany algorytmiczne. Korylator lumiczny działa na wartościach liczbowych, ale ich interpretacja nie jest bezpośrednia — kluczowe jest, jak te wartości są aktualizowane w czasie.\nProwadzący rysuje prosty wykres: oś czasu i zmieniająca się lumiczność jednego strumienia. Zwraca uwagę, że klasyczne algorytmy stabilizacji próbują „wygładzać” wykres. W przypadku korylatora to błąd, bo prowadzi do rozmycia korylacyjnego.\nZamiast tego stosuje się kaskadę stabilizacyjną, czyli kilka algorytmów działających na różnych skalach czasowych:\n   * szybka stabilizacja lokalna,\n\n   * wolna stabilizacja globalna,\n\n   * okresowa rekalibracja.\n\n________________\n\n\nStabilizacja lokalna i gradient lumiczny\nStabilizacja lokalna opiera się wyłącznie na gradiencie lumicznym. Nie analizuje pełnego profilu strumienia, tylko różnice pomiędzy kolejnymi próbkami.\nIstotna uwaga z notatek:\n„Gradient ≠ zmiana. Gradient ma znak i kierunek w przestrzeni relacyjnej.”\nTo oznacza, że dwa strumienie mogą mieć identyczną zmianę lumiczności, ale przeciwny gradient — w zależności od ich relacji z resztą macierzy luminacyjnej.\nAlgorytm lokalny:\n      * ignoruje absolutny poziom lumiczności,\n\n      * reaguje tylko na tempo zmiany relacji,\n\n      * działa w obrębie aktualnego okna lumicznego.\n\nJeśli gradient przekroczy wartość graniczną, uruchamiana jest pętla relumizacji dla danego kanału, ale bez wpływu na pozostałe.\n________________\n\n\nStabilizacja globalna i punkt równowagi\nStabilizacja globalna działa znacznie wolniej. Jej celem jest utrzymanie punktu równowagi lumicznej dla całego systemu.\nProwadzący podkreśla, że punkt ten:\n         * przesuwa się w czasie,\n\n         * zależy od liczby aktywnych strumieni,\n\n         * jest wrażliwy na degenerację korylacyjną.\n\nW praktyce stabilizacja globalna operuje na współczynniku spójności lumicznej, liczonym jako uśredniona zgodność korelacji w dłuższym horyzoncie czasowym. Gdy współczynnik spada, system stopniowo zawęża okno lumiczne, zwiększając odporność kosztem precyzji.\nTutaj pojawia się ważna uwaga o trybie semilumicznym. W tym trybie:\n            * korelacje są mniej precyzyjne,\n\n            * ale echo lumiczne zanika szybciej,\n\n            * a ryzyko awarii lumicznej jest mniejsze.\n\n________________\n\n\nImpulsy relacyjne i fałszywa stabilność\nWykładowca poświęca sporo czasu impulsom relacyjnym. Są to krótkotrwałe wzrosty zgodności między strumieniami, które mogą być:\n               * rzeczywiste (wynikające z danych),\n\n               * artefaktowe (wynikające z algorytmu stabilizacji).\n\nProblem polega na tym, że impulsy artefaktowe często zwiększają spójność lumiczną, co mylnie sugeruje poprawę stabilności. W rzeczywistości system zbliża się do przesteru lumicznego.\nZ notatek:\n„Najbardziej stabilny korylator to ten, który czasem traci korelację.”\nTo zdanie pojawia się kilka razy i prowadzący wyraźnie je podkreśla.\n________________\n\n\nPróg relumiczny i jego adaptacja\nPróg relumiczny nie jest stały. Algorytmy nowej generacji stosują adaptacyjny próg relumiczny, zależny od:\n                  * średniej lumiczności,\n\n                  * szumu lumicznego,\n\n                  * historii histerezy.\n\nJeżeli próg jest zbyt niski → system reaguje na szmer.\nJeżeli zbyt wysoki → pojawia się echo lumiczne i degeneracja.\nDlatego próg aktualizowany jest wolniej niż gradient, ale szybciej niż punkt równowagi. Prowadzący nazywa to „warstwą pośrednią stabilizacji”.\n________________\n\n\nKanały relumizacyjne\nKanały relumizacyjne nie przenoszą danych użytkowych. Ich jedyną funkcją jest dostarczanie informacji stabilizacyjnej do korylatora.\nWażne:\n                     * kanały te są logiczne, nie fizyczne,\n\n                     * ich liczba może się zmieniać w czasie,\n\n                     * w przypadku awarii lumicznej część z nich jest odcinana.\n\nOdcięcie kanału relumizacyjnego zmniejsza precyzję, ale zwiększa odporność na rozsyp lumiczny.\n________________\n\n\nInwersja lumiczna\nInwersja lumiczna to zjawisko, w którym relacja jasności informacyjnej między dwoma strumieniami odwraca się, mimo że dane wejściowe się nie zmieniły.\nProwadzący zaznacza, że inwersja:\n                        * nie jest błędem obliczeniowym,\n\n                        * często wynika z przesunięcia punktu równowagi,\n\n                        * bywa pierwszym sygnałem zbliżającej się awarii lumicznej.\n\nAlgorytmy stabilizacji nie próbują „naprawiać” inwersji bezpośrednio. Zamiast tego zmieniają parametry kaskady stabilizacyjnej, licząc na powrót systemu do równowagi.\n________________\n\n\nRozmycie korylacyjne jako kompromis\nNa koniec tej części wykładu pojawia się ważna teza:\nnie da się jednocześnie maksymalizować stabilności i precyzji.\nRozmycie korylacyjne:\n                           * obniża rozdzielczość relacji,\n\n                           * ale zwiększa odporność na szmer i dryft,\n\n                           * jest świadomym kompromisem projektowym.\n\nProwadzący zaznacza, że wiele systemów produkcyjnych działa stale w stanie lekkiego rozmycia, bo pełna precyzja jest potrzebna tylko okresowo.\nDlaczego stabilne systemy zawodzą\nProwadzący zaczyna tę część od stwierdzenia, że większość awarii lumicznych nie wynika z niestabilności, lecz z nadmiernej stabilizacji. To jest kontrintuicyjne, ale bardzo ważne: im dłużej system działa „idealnie”, tym większe ryzyko, że w pewnym momencie straci zdolność adaptacji.\nNa slajdzie pojawia się wykres spójności lumicznej w czasie — linia niemal płaska. Prowadzący mówi wprost:\n„To jest wykres systemu, który wkrótce się zepsuje.”\nPowód: brak naturalnych fluktuacji oznacza, że pętla relumizacji kompensuje nawet realne zmiany danych, zamieniając je w szmer lumiczny wtórny.\n________________\n\n\nEcho lumiczne w praktyce\nEcho lumiczne omawiane jest dużo dokładniej niż wcześniej. W praktyce występuje ono w trzech postaciach:\n                              1. echo krótkie — zanika szybko,\n\n                              2. echo długie — utrzymuje się mimo braku danych,\n\n                              3. echo strukturalne — zapisane w macierzy luminacyjnej.\n\nNajgroźniejsze jest echo strukturalne. Nie objawia się jako wyraźna korelacja, tylko jako tło, które podnosi lumiczność całego systemu. W efekcie:\n                                 * próg relumiczny przestaje działać,\n\n                                 * impulsy relacyjne są nadinterpretowane,\n\n                                 * pojawia się fałszywa spójność.\n\nW notatkach zapisane:\n„Echo strukturalne = pamięć systemu, której nie chcemy.”\n________________\n\n\nDegeneracja korylacyjna — studium przypadku\nProwadzący omawia przykład systemu z dużą liczbą podobnych strumieni. Każdy z nich osobno jest poprawny, ale razem prowadzą do degeneracji korylacyjnej.\nW takim przypadku:\n                                    * macierz luminacyjna traci rzadkość,\n\n                                    * profile lumiczne zaczynają się nakładać,\n\n                                    * korylator traktuje wiele strumieni jako jeden.\n\nAlgorytmy stabilizacji często pogarszają sytuację, bo próbują „ratować” korelacje, które już nie mają sensu. Rozwiązaniem nie jest zwiększenie precyzji, tylko kontrolowane rozmycie korylacyjne.\n________________\n\n\nZłe konfiguracje stabilizacji\nPojawia się lista „antywzorców” (bez tej nazwy, ale ewidentnie o to chodzi):\n                                       * zbyt wąskie okno lumiczne → ciągłe relumizacje,\n\n                                       * zbyt niski próg relumiczny → reakcja na szmer,\n\n                                       * brak histerezy → oscylacje,\n\n                                       * zbyt silne tłumienie quasiumiczne → echo lumiczne.\n\nProwadzący podkreśla, że nie istnieje uniwersalna konfiguracja. Parametry muszą być dobierane pod konkretne profile lumiczne strumieni.\n________________\n\n\nAwaria lumiczna krok po kroku\nBardzo ciekawy fragment: awaria lumiczna nie następuje nagle. Składa się z kilku faz:\n                                          1. Faza pozornej stabilności\n Wysoka spójność, brak alarmów.\n\n                                          2. Faza inwersji lumicznej\n Relacje zaczynają się odwracać.\n\n                                          3. Faza echa dominującego\n Echo lumiczne maskuje rzeczywiste dane.\n\n                                          4. Faza zawężenia okna\n Algorytmy próbują ratować stabilność.\n\n                                          5. Tryb degradacji\n Odcinane są kanały relumizacyjne.\n\nW notatkach obok strzałki i wykrzykniki.\n________________\n\n\nRola rekalibracji\nRekalibracja lumiczna nie jest „resetem”. To raczej powolne przesunięcie punktu odniesienia. Zbyt częsta rekalibracja powoduje utratę historii, zbyt rzadka — kumulację echa.\nProwadzący mówi, że dobra rekalibracja:\n                                             * nie powinna być zsynchronizowana,\n\n                                             * nie powinna obejmować wszystkich kanałów,\n\n                                             * powinna pozostawiać część macierzy nietkniętą.\n\nTo brzmi chaotycznie, ale sens jest jasny: system musi „pamiętać”, ale nie za dużo.\n________________\n\n\nProfil lumiczny jako narzędzie diagnostyczne\nProfil lumiczny strumienia może być używany diagnostycznie. Zmiana jego kształtu często pojawia się wcześniej niż spadek spójności.\nTypowe symptomy:\n                                                * spłaszczenie profilu → nadmierna stabilizacja,\n\n                                                * skoki lokalne → szmer lumiczny,\n\n                                                * odwrócenie asymetrii → inwersja lumiczna.\n\n________________\n\n\nMapy relacyjne w analizie awarii\nMapa relacyjna lumenu wraca jako narzędzie analizy post-mortem. Po awarii można zobaczyć:\n                                                   * które strumienie stały się centralne,\n\n                                                   * gdzie pojawiło się echo strukturalne,\n\n                                                   * które kanały relumizacyjne były przeciążone.\n\nProwadzący zaznacza, że mapy te nie są symetryczne, nawet jeśli dane wejściowe takie były.\n________________\n\n\nWniosek tej części\nNa końcu pojawia się bardzo wyraźna teza:\nstabilizacja korylatora lumicznego to sztuka zarządzania błędem, a nie jego eliminacji.\nSystem, który nigdy się nie myli, przestaje być adaptacyjny.\nPo co nam formalizm\nProwadzący zaczyna od stwierdzenia, że bez formalnego opisu bardzo łatwo pomylić:\n                                                      * stabilność z bezwładnością,\n\n                                                      * spójność z degeneracją,\n\n                                                      * echo z informacją.\n\nFormalizm nie ma tu służyć obliczeniom, tylko wymuszeniu precyzji myślenia. Na tablicy pojawia się zapis relacji pomiędzy strumieniami jako funkcji czasu i lumiczności, ale od razu pada uwaga, że nie jest to klasyczna funkcja w sensie matematycznym.\n________________\n\n\nLumiczność jako wielkość relacyjna\nLumiczność nie jest przypisana do pojedynczego strumienia. Jest definiowana względem innych strumieni. W notatkach pojawia się zdanie:\n„Nie istnieje absolutna lumiczność — istnieje tylko różnica lumiczna.”\nDlatego każda próba stabilizacji, która ignoruje macierz luminacyjną, skazana jest na niepowodzenie. Korylator nie stabilizuje sygnałów, tylko relacje między nimi.\n________________\n\n\nPseudozapis stanu korylatora\nPojawia się zapis stanu systemu jako zestawu:\n                                                         * aktualnej macierzy luminacyjnej,\n\n                                                         * wektora progów relumicznych,\n\n                                                         * parametrów kaskady stabilizacyjnej,\n\n                                                         * historii histerezy.\n\nProwadzący podkreśla, że historia jest niezbędna — bez niej nie da się odróżnić dryftu od inwersji lumicznej.\n________________\n\n\nDynamika stabilizacji\nAlgorytmy stabilizacji opisane są jako proces iteracyjny:\n                                                            1. obserwacja gradientów lumicznych,\n\n                                                            2. lokalna relumizacja,\n\n                                                            3. ocena spójności globalnej,\n\n                                                            4. korekta progów,\n\n                                                            5. ewentualna rekalibracja.\n\nWażne: te kroki nie są wykonywane synchronicznie. Każdy działa w innej skali czasowej, co jest źródłem zarówno stabilności, jak i potencjalnych problemów.\n________________\n\n\nSprzężenia i nieodwracalność\nBardzo istotny fragment dotyczy nieodwracalności niektórych stanów. Echo strukturalne, gdy raz zapisze się w macierzy luminacyjnej, nie zawsze da się usunąć bez utraty informacji.\nZ notatek:\n„Nie każda awaria jest błędem — niektóre są kosztem uczenia się systemu.”\nTo prowadzi do wniosku, że projektując korylator, trzeba przewidywać kontrolowane awarie, a nie próbować im zapobiec za wszelką cenę.\n________________\n\n\nStabilność a adaptacja\nFormalizm pokazuje, że stabilność i adaptacja są wielkościami konkurencyjnymi. Zwiększenie jednej zawsze zmniejsza drugą.\nW praktyce oznacza to, że:\n                                                               * systemy statyczne mogą być bardzo stabilne,\n\n                                                               * systemy adaptacyjne muszą tolerować błędy.\n\nTryb semilumiczny pojawia się tu ponownie jako kompromis pomiędzy tymi skrajnościami.\n________________\n\n\nGranice algorytmów stabilizacji\nProwadzący wyraźnie zaznacza, że nie istnieje algorytm, który:\n                                                                  * eliminuje echo lumiczne,\n\n                                                                  * zapobiega degeneracji,\n\n                                                                  * zachowuje pełną precyzję,\n\n                                                                  * i działa w każdych warunkach.\n\nKażda implementacja musi wybrać, które zjawiska są akceptowalne, a które krytyczne.\n________________\n\n\nInterpretacja map relacyjnych\nMapy relacyjne lumenu wracają jako narzędzie interpretacyjne. Nie służą do sterowania systemem w czasie rzeczywistym, ale do rozumienia jego zachowania.\nProwadzący zaznacza, że:\n                                                                     * mapy są zawsze opóźnione,\n\n                                                                     * pokazują przeszły stan systemu,\n\n                                                                     * ale pozwalają przewidywać przyszłe awarie.\n\n________________\n\n\nPodsumowanie wykładu\nNa ostatnim slajdzie pojawiają się trzy zdania:\n                                                                        1. Stabilizacja to proces, nie stan.\n\n                                                                        2. Błąd jest informacją.\n\n                                                                        3. Najgroźniejsza jest fałszywa stabilność.\n\nProwadzący kończy wykład stwierdzeniem, że korylator lumiczny jest przykładem systemu, który działa dobrze tylko wtedy, gdy pozwala sobie działać źle w kontrolowany sposób.\n________________\n\n\nOstatnia notatka na marginesie\nNa samym końcu, jakby mimochodem, pada zdanie zapisane w notatkach małym pismem:\n„Jeśli wszystko wygląda stabilnie — sprawdź, czy system jeszcze reaguje.”",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_1/korylator_lumiczny.txt",
      "type": "text",
      "source_file": "../../../hackathon_source_materials/lecture_1/korylator_lumiczny.txt",
      "file_type": ".txt",
      "directory": "../../../hackathon_source_materials/lecture_1"
    }
  },
  {
    "content": "[Simulated content from agarwia_meryno.docx]\nThis would contain the extracted text from the DOCX file.",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_2/agarwia_meryno.docx",
      "type": "docx",
      "source_file": "../../../hackathon_source_materials/lecture_2/agarwia_meryno.docx",
      "file_type": ".docx",
      "directory": "../../../hackathon_source_materials/lecture_2"
    }
  },
  {
    "content": "[Simulated content from neurokorelacje_roslin_pt1.pdf]\nThis would contain the extracted text from the PDF file.",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt1.pdf",
      "type": "pdf",
      "source_file": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt1.pdf",
      "file_type": ".pdf",
      "directory": "../../../hackathon_source_materials/lecture_3"
    }
  },
  {
    "content": "[Simulated content from neurokorelacje_roslin_pt2.docx]\nThis would contain the extracted text from the DOCX file.",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt2.docx",
      "type": "docx",
      "source_file": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt2.docx",
      "file_type": ".docx",
      "directory": "../../../hackathon_source_materials/lecture_3"
    }
  },
  {
    "content": "[Simulated OCR/image analysis from neurokorelacje_roslin_pt3_3.png]\nThis would contain extracted text or image descriptions.",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt3_3.png",
      "type": "image",
      "source_file": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt3_3.png",
      "file_type": ".png",
      "directory": "../../../hackathon_source_materials/lecture_3"
    }
  },
  {
    "content": "[Simulated OCR/image analysis from neurokorelacje_roslin_pt3_2.png]\nThis would contain extracted text or image descriptions.",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt3_2.png",
      "type": "image",
      "source_file": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt3_2.png",
      "file_type": ".png",
      "directory": "../../../hackathon_source_materials/lecture_3"
    }
  },
  {
    "content": "[Simulated OCR/image analysis from neurokorelacje_roslin_pt3_1.png]\nThis would contain extracted text or image descriptions.",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt3_1.png",
      "type": "image",
      "source_file": "../../../hackathon_source_materials/lecture_3/neurokorelacje_roslin_pt3_1.png",
      "file_type": ".png",
      "directory": "../../../hackathon_source_materials/lecture_3"
    }
  },
  {
    "content": "[Simulated content from predykcyjne_sieci_pt1.docx]\nThis would contain the extracted text from the DOCX file.",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_4/predykcyjne_sieci_pt1.docx",
      "type": "docx",
      "source_file": "../../../hackathon_source_materials/lecture_4/predykcyjne_sieci_pt1.docx",
      "file_type": ".docx",
      "directory": "../../../hackathon_source_materials/lecture_4"
    }
  },
  {
    "content": "scenario_id,time_index,entropy_decyzyjna,confidence_predykcji,predykcyjny_margines_bezpieczenstwa,stabilnosc_probabilistyczna,szum_informacyjny,dyfuzja_informacyjna,metastabilnosc,czas_wyprzedzenia_predykcyjnego,ryzyko_energetyczne,interwencja_predykcyjna\nS01,1,0.72,0.31,0.18,0.42,0.67,0.81,0.84,2.1,0.76,0.12\nS02,2,0.65,0.38,0.22,0.48,0.61,0.74,0.79,2.4,0.71,0.15\nS03,3,0.58,0.46,0.29,0.56,0.55,0.69,0.65,3.1,0.63,0.21\nS04,4,0.49,0.54,0.36,0.64,0.48,0.61,0.52,3.8,0.54,0.28\nS05,5,0.41,0.63,0.44,0.72,0.39,0.53,0.38,4.6,0.43,0.35\nS06,6,0.35,0.71,0.51,0.79,0.32,0.46,0.31,5.2,0.36,0.41\nS07,7,0.33,0.74,0.55,0.82,0.29,0.44,0.28,5.6,0.33,0.44\nS08,8,0.36,0.69,0.53,0.8,0.34,0.49,0.34,5.1,0.38,0.39\nS09,9,0.44,0.58,0.45,0.71,0.42,0.57,0.46,4.3,0.49,0.31\nS10,10,0.53,0.47,0.34,0.6,0.51,0.65,0.59,3.5,0.61,0.24\nS11,11,0.61,0.39,0.26,0.51,0.58,0.71,0.68,2.9,0.69,0.18\nS12,12,0.69,0.33,0.19,0.44,0.64,0.78,0.77,2.3,0.75,0.14\nS13,13,0.77,0.27,0.14,0.38,0.71,0.85,0.86,1.9,0.82,0.09\nS14,14,0.81,0.22,0.11,0.34,0.75,0.88,0.9,1.6,0.86,0.07\nS15,15,0.84,0.19,0.09,0.31,0.79,0.91,0.93,1.4,0.89,0.05\n",
    "metadata": {
      "source": "../../../hackathon_source_materials/lecture_4/predykcyjne_sieci_pt2.csv",
      "type": "csv",
      "source_file": "../../../hackathon_source_materials/lecture_4/predykcyjne_sieci_pt2.csv",
      "file_type": ".csv",
      "directory": "../../../hackathon_source_materials/lecture_4"
    }
  }
]